app/controllers/links_controller.rb

SELECT "links".* FROM "links" ORDER BY "links"."ranking" DESC
---
  def index
    # @links = Link.all
    @links = Link.order(ranking: :desc)

INSERT INTO "links" ("link_text", "ranking", "videoid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["link_text", "https://www.youtube.com/watch?v=gO4ZIgHOR50"], ["ranking", ""], ["videoid", ""], ["created_at", 2017-01-26 16:55:36 UTC], ["updated_at", 2017-01-26 16:55:36 UTC]]
---
  def create
    @link = Link.new(link_params)

    respond_to do |format|
      if @link.save

UPDATE "links" SET "view_count" = ?, "updated_at" = ?, "ranking" = ?, "title" = ? WHERE "links"."id" = ?  [["view_count", "115321"], ["updated_at", 2017-01-29 10:41:21 UTC], ["ranking", 19220.0], ["title", "007 (James Bond) Tribute | Tushar Lall | The Indian Jam Project"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @link.update(link_params)